default_settings = dict(
    organization=(
        'Министерство здравоохранения\n'
        'Российской Федерации\n'
        '«Наркологический Диспансер»\n'
        'г. Энск, ул. Ленина, 1\n'
        'ЛО-98-76-543210 от 02 февраля 2020 г.'
    ),
    subdivision='Кабинет медицинского освидетельствования',
    doctors={
        '111': 'Иванов И.И., г. Энск «Наркологический Диспансер», 02.02.2020',
        '222': 'Петров П.П., г. Энск «Наркологический Диспансер», 02.02.2020',
        '333': 'Сидоров С.С., г. Энск «Наркологический Диспансер», 02.02.2020',
    },
    devices=[
        'ALCOTEST 1234, ABCD-0123, 02.02.2020, 0.05 мг/л',
        'ALCOTEST 3456, BCDE-2345, 02.02.2020, 0.05 мг/л',
    ],
    laboratory='Лаборатория «Наркологический Диспансер» г. Энск',
    substances=['пиво', 'водка', 'лимонад'],
    methods=['случайное угадывание', 'научный тык'],
    next_number=1,
    password='000',
)
